
🏗️ Terraform Plan
```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.supernode[0].netbox_ip_address.management_ipv6 has been deleted
  - resource "netbox_ip_address" "management_ipv6" {
      - id                           = "698" -> null
        tags                         = []
        # (8 unchanged attributes hidden)
    }

  # module.supernode[0].proxmox_vm_qemu.supernode has been deleted
  - resource "proxmox_vm_qemu" "supernode" {
        id                     = "pm4/qemu/104"
        name                   = "supernode-dev-0"
        # (26 unchanged attributes hidden)

      - network {
          - macaddr   = "BC:24:11:CC:2B:C3" -> null
            # (8 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.test will be created
  + resource "null_resource" "test" {
      + id = (known after apply)
    }

  # module.supernode[0].data.iphelpers_eui64_address.supernode_management will be read during apply
  # (config refers to values not yet known)
 <= data "iphelpers_eui64_address" "supernode_management" {
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + prefix       = "2001:678:b7c:201::"
    }

  # module.supernode[0].netbox_interface.eth0 will be updated in-place
  ~ resource "netbox_interface" "eth0" {
        id                 = "73"
      ~ mac_address        = "0E:E1:97:F8:CA:84" -> (known after apply)
        name               = "eth0"
        tags               = []
        # (4 unchanged attributes hidden)
    }

  # module.supernode[0].netbox_ip_address.management_ipv6 will be created
  + resource "netbox_ip_address" "management_ipv6" {
      + description                  = "Management Address dev-0"
      + id                           = (known after apply)
      + ip_address                   = (known after apply)
      + nat_outside_addresses        = (known after apply)
      + status                       = "slaac"
      + virtual_machine_interface_id = 73
    }

  # module.supernode[0].netbox_primary_ip.supernode will be updated in-place
  ~ resource "netbox_primary_ip" "supernode" {
        id                 = "64"
      ~ ip_address_id      = 808 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.supernode[0].proxmox_vm_qemu.supernode will be created
  + resource "proxmox_vm_qemu" "supernode" {
      + additional_wait           = 0
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "c"
      + bootdisk                  = "virtio0"
      + ciuser                    = "admin"
      + clone                     = "debian12-guest-agent"
      + clone_wait                = 0
      + cloudinit_cdrom_storage   = "system"
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = false
      + desc                      = "Supernode v2 - dev-0"
      + force_create              = false
      + full_clone                = false
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp,ip6=auto"
      + kvm                       = true
      + memory                    = 1024
      + name                      = "supernode-dev-0"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "Supernodes2.0"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIN9C1hWDBL9driOUQhemBqYUFA1I7VM1UYt5ZDnIynZa
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAsGlElGJxP1/Mr1AhoZsWQn7N8+cZNA3lMd8HPDHRQj
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJHQFe5F5okyt3Oo70cSeZTyUs9c6DFEw3a3jSmtpg+B
        EOT
      + tablet                    = true
      + target_node               = "pm2"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = 0
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "4G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "system"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + vga {
          + memory = 0
          + type   = "serial0"
        }
    }

  # module.supernode[1].data.iphelpers_eui64_address.supernode_management will be read during apply
  # (config refers to values not yet known)
 <= data "iphelpers_eui64_address" "supernode_management" {
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + prefix       = "2001:678:b7c:201::"
    }

  # module.supernode[1].netbox_available_ip_address.primary_ipv4 will be created
  + resource "netbox_available_ip_address" "primary_ipv4" {
      + description = "Primary Address dev-1"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[1].netbox_available_ip_address.primary_ipv6 will be created
  + resource "netbox_available_ip_address" "primary_ipv6" {
      + description = "Primary Address dev-1"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[1].netbox_available_prefix.primary_ipv4 will be created
  + resource "netbox_available_prefix" "primary_ipv4" {
      + description      = "Primary Address dev-1"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + status           = "active"
    }

  # module.supernode[1].netbox_available_prefix.primary_ipv6 will be created
  + resource "netbox_available_prefix" "primary_ipv6" {
      + description      = "Primary Address dev-1"
      + id               = (known after apply)
      + parent_prefix_id = 332
      + prefix           = (known after apply)
      + prefix_length    = 128
      + status           = "active"
    }

  # module.supernode[1].netbox_interface.eth0 will be created
  + resource "netbox_interface" "eth0" {
      + enabled            = true
      + id                 = (known after apply)
      + mac_address        = (known after apply)
      + name               = "eth0"
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[1].netbox_ip_address.management_ipv6 will be created
  + resource "netbox_ip_address" "management_ipv6" {
      + description                  = "Management Address dev-1"
      + id                           = (known after apply)
      + ip_address                   = (known after apply)
      + nat_outside_addresses        = (known after apply)
      + status                       = "slaac"
      + virtual_machine_interface_id = (known after apply)
    }

  # module.supernode[1].netbox_primary_ip.supernode will be created
  + resource "netbox_primary_ip" "supernode" {
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
      + virtual_machine_id = (known after apply)
    }

  # module.supernode[1].netbox_virtual_machine.supernode will be created
  + resource "netbox_virtual_machine" "supernode" {
      + cluster_id   = 1
      + disk_size_gb = 4
      + id           = (known after apply)
      + memory_mb    = 1024
      + name         = "supernode-dev-1"
      + primary_ipv4 = (known after apply)
      + primary_ipv6 = (known after apply)
      + role_id      = 48
      + site_id      = 12
      + status       = "staged"
      + vcpus        = 2
    }

  # module.supernode[1].proxmox_vm_qemu.supernode will be created
  + resource "proxmox_vm_qemu" "supernode" {
      + additional_wait           = 0
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "c"
      + bootdisk                  = "virtio0"
      + ciuser                    = "admin"
      + clone                     = "debian12-guest-agent"
      + clone_wait                = 0
      + cloudinit_cdrom_storage   = "system"
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = false
      + desc                      = "Supernode v2 - dev-1"
      + force_create              = false
      + full_clone                = false
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=dhcp,ip6=auto"
      + kvm                       = true
      + memory                    = 1024
      + name                      = "supernode-dev-1"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "Supernodes2.0"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + sshkeys                   = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIN9C1hWDBL9driOUQhemBqYUFA1I7VM1UYt5ZDnIynZa
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAsGlElGJxP1/Mr1AhoZsWQn7N8+cZNA3lMd8HPDHRQj
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJHQFe5F5okyt3Oo70cSeZTyUs9c6DFEw3a3jSmtpg+B
        EOT
      + tablet                    = true
      + target_node               = "pm2"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = 0
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "4G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "system"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + vga {
          + memory = 0
          + type   = "serial0"
        }
    }

Plan: 12 to add, 2 to change, 0 to destroy.
```